test/artilleryq.yml
config:
  target: 'https://10.148.0.2'
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 1
      arrivalRate: 300
  defaults:
    gzip: true
  timeout: 5
  payload:
    path: "examinee.csv"
    order: sequence
    fields:
      - "id"
      - "name"
      - "token"
      - "aux2"
      - "aux3"
scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/static/exam/pack.css"
    - get:
        url: "/static/exam/exam.css"
    - get:
        url: "/static/exam/pack.js"
    - post:
        url: "/exam/login"
        form: 
          token: "{{ token }}"
        followRedirect: false
    - get:
        url: "/exam/lounge"
    - get:
        url: "/static/exam/lounge.js"
    - get:
        url: "/exam/problem"
        followRedirect: false
    - loop:
        - get:
            url: "/exam/problem/{{ $loopElement }}"
            capture:
              - selector: '#content img.ui.img'
                attr: 'src'
                as: "main_img"
              - selector: '#large-img img.ui.img'
                attr: 'src'
                as: "aux_img"
        # - log: "{{ main_img }}, {{ aux_img }}"
        - get:
            url: "/static/exam/problem.js"
        - get:
            url: "{{ main_img }}"
            ifTrue: "main_img"
        - get:
            url: "{{ aux_img }}"
            ifTrue: "aux_img"
        - post:
            url: "/exam/problem_loaded"
            form: 
              problem: "{{ $loopElement }}"
        - think: 5
        - post:
            url: "/exam/problem/{{ $loopElement }}"
            form: 
              problem: "{{ $loopElement }}"
              choice: 1
            followRedirect: false
      over: ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16']
    - get:
        url: "/exam/finish"